
/*Создадим переменную в которую можно загнать моножесто классов, 
для удобного использования их в коде.
Т.е здесь он их обнаруживает один раз и все, 
а не перед каждой выборкой! это полезная фитча*/
var my = {
    window : $(window)
  };
  
  /*Собственно и сама функция*/
  $(window).resize(function () {
  
    /*Переменная которая определяет ширину окна 
    и загоняет ее в переменную width*/
    var width = my.window.width();
  
    /*условие трансформации окна т.е условие которое выполнится 
    когда ширина окна достигнет определенных размеров*/
    if(my.window.width() <= 900)
        {
            location.href='mobile/index.html';
  
      if(width < 480) {
        /*какое-нибудь условие*/
        if(width < 320) {
            /*какое-нибудь условие*/
        }
      }
    }
    /*Возвращает все стили на свои места т.е 
    при расширении он примет первоначальный вид*/
    else {
      $('.right-content').css({'float':'left', 'clear':'none'});
      $('.header-menu').css('float','none');
    }
  
  });